gorang28/Wi-Sense/firmware/wisense_hw/sdkconfig.defaults
# Module 1 hardware bring-up defaults (ESP32 classic DevKit).
CONFIG_IDF_TARGET="esp32"

# Console UART for idf.py monitor + placeholder keys e/p/m/f.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Classifier / OLED component defaults (overridable via menuconfig).
CONFIG_WISENSE_CLASSIFIER_PLACEHOLDER=y
CONFIG_WISENSE_CLASSIFIER_UART_NUM=0
CONFIG_WISENSE_CLASSIFIER_UART_BAUD=115200
CONFIG_WISENSE_OLED_I2C_SDA_GPIO=21
CONFIG_WISENSE_OLED_I2C_SCL_GPIO=22
CONFIG_WISENSE_OLED_I2C_ADDR=0x3C

# Module 2: relay + LDR (HIGH on DO = dark on typical LM393 modules).
CONFIG_WISENSE_LIGHT_RELAY_GPIO=26
CONFIG_WISENSE_LIGHT_RELAY_ON_HIGH=y
CONFIG_WISENSE_LIGHT_LDR_GPIO=32
CONFIG_WISENSE_LIGHT_LDR_DARK_IS_HIGH=y
CONFIG_WISENSE_LIGHT_EMPTY_OFF_SEC=5
CONFIG_WISENSE_LIGHT_LDR_POLL_MS=500

# Module 3: FSR406 on ADC GPIO34 (tune threshold in menuconfig if needed).
CONFIG_WISENSE_FSR_GPIO=34
CONFIG_WISENSE_FSR_PRESS_THRESHOLD=1500

# Module 4+5: cancel button + fall emergency countdown.
CONFIG_WISENSE_EMERGENCY_BUTTON_GPIO=27
CONFIG_WISENSE_EMERGENCY_BUTTON_ACTIVE_LOW=y
CONFIG_WISENSE_EMERGENCY_COUNTDOWN_SEC=15
